########################################
#  학번 :30221          이름:조민건 
########################################
# 화일을 학번 이름으로 먼저 저장하세요. 예) 30129김상일

# <문제 1> 
#   - 숫자 5개를 입력받고 입력 받은 수 중에서 가장 큰 수를 출력하세요.
#   - 숫자 5개를 입력받는 부분은 for 반복문으로 작성하세요.








# <문제 2>
# 1. 생년월일을 다음과 같이 8자리로 입력 받는다.
#   예) 20031127
#      
# 2. 입력 받은 생년월일을 다음과 같이 처리해서 출력한다.
#  예)  2003년 11월 27일
a=input("생년월일")
print(a[0:4] + "년",a[4:6] + "월",a[6:8] + "일") 








# <문제 3> 
#   - 다음 조건을 만족하는 프로그램을 작성하세요.
#     - 무한 반복되는 while 문을 사용한다.
#     - 두 수를 입력 받아서 두 수가 같으면 break 문을 사용해 무한 반복문을 종료한다.
while    
    a=(input('숫자'))
    b=(input('숫자'))
    if < a 







# <문제 4> 
#   - 다음 조건을 만족하는 프로그램을 작성하세요.
#    - 1부터 50까지의 수를 출력한다. 단, 3의 배수는 출력하지 않는다.

print('1','2','4','5','7','8','10','11','13','14','16','17','19','20','22','23','25','26',
      '28','29','31','32','34','35','37','38','40','41','43','44','46','47','49','50')



